artillery-load-test.yml
config:
  target: "http://localhost:3500"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 users"
    - duration: 120
      arrivalRate: 100
      name: "Sustained load of 100 users/sec"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Consulter Health Check et Métriques"
    flow:
      - get:
          url: "/api/health"
      - get:
          url: "/api/metrics"